package Sort;
/**
<<<<<<< HEAD
 * ï¿½ï¿½ï¿½ï¿½ï¿½Ê¼ï¿½ï¿½
ï¿½ï¿½Ê¼ï¿½ï¿½ï¿½Ñµï¿½Ê±ï¿½ï¿½ï¿½Ç¶ï¿½ï¿½ï¿½ï¿½ĞµÄ·ï¿½Ò¶ï¿½Ó½ï¿½ï¿½ï¿½ï¿½ï¿½É¸Ñ¡ï¿½ï¿½
ï¿½ï¿½ï¿½Ò»ï¿½ï¿½ï¿½ï¿½ï¿½Õ¶ï¿½Ôªï¿½Øµï¿½ï¿½Â±ï¿½ï¿½ï¿½[n/2]ï¿½ï¿½ï¿½ï¿½È¡ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½É¸Ñ¡Ö»ï¿½ï¿½Òªï¿½Óµï¿½[n/2]ï¿½ï¿½ï¿½ï¿½È¡ï¿½ï¿½ï¿½ï¿½Ôªï¿½Ø¿ï¿½Ê¼ï¿½ï¿½ï¿½Óºï¿½ï¿½ï¿½Ç°ï¿½ï¿½ï¿½Ğµï¿½ï¿½ï¿½ï¿½ï¿½
ï¿½ï¿½ï¿½ç£¬ï¿½ï¿½ï¿½ï¿½Ò»ï¿½ï¿½ï¿½ï¿½ï¿½é£¬ï¿½ï¿½ï¿½È¸ï¿½ï¿½İ¸ï¿½ï¿½ï¿½ï¿½ï¿½Ôªï¿½Ø¹ï¿½ï¿½ï¿½Ò»ï¿½ï¿½ï¿½ï¿½È«ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
È»ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ò»ï¿½ï¿½ï¿½ï¿½Ò¶ï¿½Ó½ï¿½ã¿ªÊ¼ï¿½ï¿½Ã¿ï¿½Î¶ï¿½ï¿½Ç´Ó¸ï¿½ï¿½ï¿½ã¡¢ï¿½ï¿½ï¿½Ó¡ï¿½ï¿½Òºï¿½ï¿½ï¿½ï¿½Ğ½ï¿½ï¿½Ğ±È½Ï½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ü»ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ó½ï¿½ã²»ï¿½ï¿½ï¿½ï¿½Ñµï¿½ï¿½ï¿½ï¿½Ê£ï¿½ï¿½ï¿½ï¿½ï¿½Ã¿ï¿½Î½ï¿½ï¿½ï¿½Ö®ï¿½ï¿½ï¿½ï¿½Òªï¿½ï¿½ï¿½Â¶Ô±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Äºï¿½ï¿½Ó½ï¿½ï¿½ï¿½ï¿½Ğµï¿½ï¿½ï¿½ï¿½ï¿½
ï¿½ï¿½ï¿½Ğ¶ï¿½ï¿½ï¿½ï¿½ï¿½
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ë³ï¿½Ê¼ï¿½ï¿½Ö®ï¿½ï¿½Í¿ï¿½ï¿½Ô½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ë¡ï¿½
ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ò»ï¿½ï¿½Ñ¡ï¿½ï¿½ï¿½ï¿½ï¿½ò¡£½ï¿½ï¿½ï¿½ï¿½Ä³ï¿½Ê¼ï¿½ï¿½Îªï¿½ï¿½Ê¼ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
ï¿½ï¿½ï¿½ï¿½Ê¼ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ñ¶ï¿½Ôªï¿½Ø£ï¿½ï¿½ï¿½Îªï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Öµï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ñ¶ï¿½Ôªï¿½Øºï¿½ï¿½ï¿½ï¿½Ò»ï¿½ï¿½Ôªï¿½Ø½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½nï¿½ï¿½Î»ï¿½Ã£ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ò»ï¿½ï¿½Î»ï¿½Ã£ï¿½ï¿½ï¿½Îªï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ç°n-1ï¿½ï¿½Î»ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ğµï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ãµï¿½ï¿½ï¿½Ö®ï¿½ï¿½ï¿½Ù½ï¿½ï¿½ï¿½ï¿½Ñ¶ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ò»ï¿½ï¿½Ôªï¿½Ø£ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½È±ï¿½Îª2ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½
ï¿½ï¿½ï¿½Ï½ï¿½ï¿½Ğ´Ë²ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ê£ï¿½Âµï¿½Ôªï¿½ï¿½ï¿½ï¿½ï¿½Âµï¿½ï¿½ï¿½Îªï¿½Ñ£ï¿½È»ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ñ¶ï¿½Ôªï¿½Øµï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ã¿ï¿½Î½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½-1ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½+1ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Ø¸ï¿½ï¿½Ë¹ï¿½ï¿½ï¿½Ö±ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½Îªn-1ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½ï¿½É¡ï¿½*/
=======
 * ¹¹Ôì³õÊ¼¶Ñ
³õÊ¼»¯¶ÑµÄÊ±ºòÊÇ¶ÔËùÓĞµÄ·ÇÒ¶×Ó½áµã½øĞĞÉ¸Ñ¡¡£
×îºóÒ»¸ö·ÇÖÕ¶ËÔªËØµÄÏÂ±êÊÇ[n/2]ÏòÏÂÈ¡Õû£¬ËùÒÔÉ¸Ñ¡Ö»ĞèÒª´ÓµÚ[n/2]ÏòÏÂÈ¡Õû¸öÔªËØ¿ªÊ¼£¬´ÓºóÍùÇ°½øĞĞµ÷Õû¡£
±ÈÈç£¬¸ø¶¨Ò»¸öÊı×é£¬Ê×ÏÈ¸ù¾İ¸ÃÊı×éÔªËØ¹¹ÔìÒ»¸öÍêÈ«¶ş²æÊ÷¡£
È»ºó´Ó×îºóÒ»¸ö·ÇÒ¶×Ó½áµã¿ªÊ¼£¬Ã¿´Î¶¼ÊÇ´Ó¸¸½áµã¡¢×óº¢×Ó¡¢ÓÒº¢×ÓÖĞ½øĞĞ±È½Ï½»»»£¬½»»»¿ÉÄÜ»áÒıÆğº¢×Ó½áµã²»Âú×ã¶ÑµÄĞÔÖÊ£¬ËùÒÔÃ¿´Î½»»»Ö®ºóĞèÒªÖØĞÂ¶Ô±»½»»»µÄº¢×Ó½áµã½øĞĞµ÷Õû¡£
½øĞĞ¶ÑÅÅĞò
¡¡¡¡ÓĞÁË³õÊ¼¶ÑÖ®ºó¾Í¿ÉÒÔ½øĞĞÅÅĞòÁË¡£
¶ÑÅÅĞòÊÇÒ»ÖÖÑ¡ÔñÅÅĞò¡£½¨Á¢µÄ³õÊ¼¶ÑÎª³õÊ¼µÄÎŞĞòÇø¡£
ÅÅĞò¿ªÊ¼£¬Ê×ÏÈÊä³ö¶Ñ¶¥ÔªËØ£¨ÒòÎªËüÊÇ×îÖµ£©£¬½«¶Ñ¶¥ÔªËØºÍ×îºóÒ»¸öÔªËØ½»»»£¬ÕâÑù£¬µÚn¸öÎ»ÖÃ£¨¼´×îºóÒ»¸öÎ»ÖÃ£©×÷ÎªÓĞĞòÇø£¬Ç°n-1¸öÎ»ÖÃÈÔÊÇÎŞĞòÇø£¬¶ÔÎŞĞòÇø½øĞĞµ÷Õû£¬µÃµ½¶ÑÖ®ºó£¬ÔÙ½»»»¶Ñ¶¥ºÍ×îºóÒ»¸öÔªËØ£¬ÕâÑùÓĞĞòÇø³¤¶È±äÎª2¡£¡£¡£
²»¶Ï½øĞĞ´Ë²Ù×÷£¬½«Ê£ÏÂµÄÔªËØÖØĞÂµ÷ÕûÎª¶Ñ£¬È»ºóÊä³ö¶Ñ¶¥ÔªËØµ½ÓĞĞòÇø¡£Ã¿´Î½»»»¶¼µ¼ÖÂÎŞĞòÇø-1£¬ÓĞĞòÇø+1¡£²»¶ÏÖØ¸´´Ë¹ı³ÌÖ±µ½ÓĞĞòÇø³¤¶ÈÔö³¤Îªn-1£¬ÅÅĞòÍê³É¡£*/
>>>>>>> origin/master
public class HeapSort {
	public static void swap(int[] a,int i,int j)
    {
        if(i==j)
        {
            return;
        }
        int t=a[i];
        a[i]=a[j];
        a[j]=t;
    }
    public static void heap(int[] a,int last)
    {
        for(int i=(last-1)/2;i>=0;i--)
        {
        	int k=i;
        	while(2*k+1<=last)
        	{
        		int big=2*k+1;
        		while(big<last && a[big]<a[big+1])
        			big++;
        		if(a[big]>a[k])
        			swap(a,big,k);
        		else
        			break;
        	}
        }
    }
    public static void heapify(int[] A) {
        // write your code here
        if(A==null || A.length==0)
            return;
        for(int i=0;i<A.length;i++)
        {
            heap(A,A.length-1-i);
            swap(A,0,A.length-1-i);
        }
        
    }
//	private static void siftup(int[] A, int k) {
//        while (k != 0) {
//            int father = (k - 1) / 2;
//            if (A[k] > A[father]) {
//                break;
//            }
//            int temp = A[k];
//            A[k] = A[father];
//            A[father] = temp;
//            
//            k = father;
//        }
//    }
//    
//    public static void heapify(int[] A) {
//        for (int i = 0; i < A.length; i++) {
//            siftup(A, i);
//        }
//    }
	public static void main(String[] args) {
		// TODO Auto-generated method stub
		int[] n={3,7,8,4,1,6,5,2};
        heapify(n);
        for(int i=0;i<n.length;i++)
        	System.out.print(n[i]+" ");
	}

<<<<<<< HEAD



    public static void sort(Comparable[] data) {
            // æ„å»ºæœ€å¤§å †
            buildMaxHeap(data);
            // å¾ªç¯ï¼Œæ¯æ¬¡æŠŠæ ¹èŠ‚ç‚¹å’Œæœ€åä¸€ä¸ªèŠ‚ç‚¹è°ƒæ¢ä½ç½®
            for (int i = data.length; i > 1; i--) {
                Comparable tmp = data[0];
                data[0] = data[i - 1];
                data[i - 1] = tmp;

                // å †çš„é•¿åº¦å‡å°‘1ï¼Œæ’é™¤ç½®æ¢åˆ°æœ€åä½ç½®çš„æ ¹èŠ‚ç‚¹
                maxHeapify(data, 1, i - 1);
            }
        }

        // æ ¹æ®è¾“å…¥æ•°ç»„æ„å»ºä¸€ä¸ªæœ€å¤§å †
        private static void buildMaxHeap(Comparable[] data) {
            for (int i = data.length / 2; i > 0; i--) {
                maxHeapify(data, i, data.length);
            }
        }

        //å †è°ƒæ•´ï¼Œä½¿å…¶ç”Ÿæˆæœ€å¤§å †
        private static void maxHeapify(Comparable[] data, int parentNodeIndex, int heapSize) {
            // å·¦å­èŠ‚ç‚¹ç´¢å¼•
            int leftChildNodeIndex = parentNodeIndex * 2;
            // å³å­èŠ‚ç‚¹ç´¢å¼•
            int rightChildNodeIndex = parentNodeIndex * 2 + 1;
            // æœ€å¤§èŠ‚ç‚¹ç´¢å¼•
            int largestNodeIndex = parentNodeIndex;

            // å¦‚æœå·¦å­èŠ‚ç‚¹å¤§äºçˆ¶èŠ‚ç‚¹ï¼Œåˆ™å°†å·¦å­èŠ‚ç‚¹ä½œä¸ºæœ€å¤§èŠ‚ç‚¹
            if (leftChildNodeIndex <= heapSize && data[leftChildNodeIndex - 1].compareTo(data[parentNodeIndex - 1]) > 0) {
                largestNodeIndex = leftChildNodeIndex;
            }

            // å¦‚æœå³å­èŠ‚ç‚¹æ¯”æœ€å¤§èŠ‚ç‚¹è¿˜å¤§ï¼Œé‚£ä¹ˆæœ€å¤§èŠ‚ç‚¹åº”è¯¥æ˜¯å³å­èŠ‚ç‚¹
            if (rightChildNodeIndex <= heapSize && data[rightChildNodeIndex - 1].compareTo(data[largestNodeIndex - 1]) > 0) {
                largestNodeIndex = rightChildNodeIndex;
            }

            // æœ€åï¼Œå¦‚æœæœ€å¤§èŠ‚ç‚¹å’Œçˆ¶èŠ‚ç‚¹ä¸ä¸€è‡´ï¼Œåˆ™äº¤æ¢ä»–ä»¬çš„å€¼
            if (largestNodeIndex != parentNodeIndex) {
                Comparable tmp = data[parentNodeIndex - 1];
                data[parentNodeIndex - 1] = data[largestNodeIndex - 1];
                data[largestNodeIndex - 1] = tmp;

                // äº¤æ¢å®Œçˆ¶èŠ‚ç‚¹å’Œå­èŠ‚ç‚¹çš„å€¼ï¼Œå¯¹æ¢äº†å€¼çš„å­èŠ‚ç‚¹æ£€æŸ¥æ˜¯å¦ç¬¦åˆæœ€å¤§å †çš„ç‰¹æ€§
                maxHeapify(data, largestNodeIndex, heapSize);
            }
        }



=======
>>>>>>> origin/master
}
